app/views/mangas/edit.html.erb


<% if @manga.chapters.count > 0 %>
---
SELECT `chapters`.* FROM `chapters` WHERE `chapters`.`manga_id` = 1