app/views/mangas/show.html.erb

<h2>Read Chapters</h2>
<% @manga.chapters.each do |chapter| %>
---
SELECT `chapters`.* FROM `chapters` WHERE `chapters`.`manga_id` IN (1)