app/views/sitepages/about.html.erb

SELECT "pagetexts".* FROM "pagetexts" WHERE "pagetexts"."id" = $1 LIMIT 1  [["id", 2]]
---
<h1>About Me</h1>
<%=raw Pagetext.find(2).text %>