app/views/sitepages/home.html.erb


<%=raw Pagetext.find(1).text %>
---
SELECT "pagetexts".* FROM "pagetexts" WHERE "pagetexts"."id" = $1 LIMIT 1  [["id", 1]]