app/views/sitepages/media.html.erb

SELECT "pagetexts".* FROM "pagetexts" WHERE "pagetexts"."id" = $1 LIMIT 1  [["id", 5]]
---
<h1>Media</h1>
<%=raw Pagetext.find(5).text %>