app/views/chapters/show.html.erb

SELECT "chapters".* FROM "chapters" WHERE "chapters"."manga_id" = 1
---
							<ul id="chapters-dropdown" class="dropdown-menu">
								<% @manga.chapters.each do |chapter| %>

SELECT "pages".* FROM "pages" WHERE "pages"."chapter_id" = 1
---
							<ul class="pages-dropdown dropdown-menu">
								<% @chapter.sorted_pages.each do |page| %>