app/controllers/blogs_controller.rb

INSERT INTO "blogs" ("body", "created_at", "title", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
  def create
    @blog = Blog.new(params[:blog])

    respond_to do |format|
      if @blog.save

SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "blogs" SET "body" = 'Lorem ipsum dolor sit amet, consectetur adipiscing elit. Morbi velit purus, adipiscing eget ullamcorper non, ornare et mauris. Vestibulum vel tincidunt leo. Nunc sagittis at lorem et vehicula. Aliquam pharetra eleifend libero vel ullamcorper. Aliquam erat volutpat. Maecenas a massa neque. Donec at nunc suscipit, euismod ligula at, fringilla odio. Suspendisse ac risus in ligula pulvinar aliquet in quis nunc. Aenean venenatis imperdiet iaculis. Morbi ac lacus et ligula pharetra rhoncus. Pellentesque dolor nisi, malesuada id risus sed, rhoncus porta purus.
---
  def update
    @blog = Blog.find(params[:id])

    respond_to do |format|
      if @blog.update_attributes(params[:blog])