app/controllers/chapters_controller.rb

SELECT `mangas`.* FROM `mangas` WHERE `mangas`.`slug` = 'double-blackness' LIMIT 1
---
	def new
		@manga = Manga.find_by_slug(params[:manga_id])

SELECT "mangas".* FROM "mangas" WHERE "mangas"."slug" = 'double-blackness' LIMIT 1
INSERT INTO "chapters" ("created_at", "manga_id", "title", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Sat, 11 Jan 2014 01:11:57 UTC +00:00], ["manga_id", 1], ["title", "First Chapter"], ["updated_at", Sat, 11 Jan 2014 01:11:57 UTC +00:00]]
---
	def create
		@manga = Manga.find_by_slug(params[:manga_id])
		@chapter = @manga.chapters.create!(params[:chapter])

SELECT "chapters".* FROM "chapters" WHERE "chapters"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "mangas".* FROM "mangas" WHERE "mangas"."slug" = 'double-blackness' LIMIT 1
---
	def show
		@chapter = Chapter.find(params[:id])
		@manga = Manga.find_by_slug(params[:manga_id])

SELECT "mangas".* FROM "mangas" WHERE "mangas"."slug" = 'double-blackness' LIMIT 1
SELECT "chapters".* FROM "chapters" WHERE "chapters"."id" = $1 LIMIT 1  [["id", "1"]]
---
	def edit
		@manga = Manga.find_by_slug(params[:manga_id])
		@chapter = Chapter.find(params[:id])