app/controllers/items_controller.rb

SELECT "items".* FROM "items" WHERE "items"."category" = 'Commission' LIMIT 1
---
  def index
    @commissions = Item.find_all_by_category("Commission")

INSERT INTO "items" ("category", "created_at", "imageurl", "paypalcode", "price", "title", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @item = Item.new(params[:item])

    respond_to do |format|
      if @item.save

SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT 1  [["id", "2"]]
UPDATE "items" SET "category" = 'Commission', "updated_at" = '2014-01-13 03:14:35.705872' WHERE "items"."id" = 2
---
  def update
    @item = Item.find(params[:id])

    respond_to do |format|
      if @item.update_attributes(params[:item])