app/controllers/links_controller.rb

INSERT INTO "links" ("created_at", "description", "updated_at", "url") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Sun, 12 Jan 2014 05:04:24 UTC +00:00], ["description", "Such a great website"], ["updated_at", Sun, 12 Jan 2014 05:04:24 UTC +00:00], ["url", "http://luckyhitcrew.com"]]
---
  def create
    @link = Link.new(params[:link])

    respond_to do |format|
      if @link.save