app/controllers/mangas_controller.rb

SELECT `mangas`.* FROM `mangas`
---
  def index
  	@mangas = Manga.all

INSERT INTO "mangas" ("created_at", "name", "slug", "synopsis", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Sat, 11 Jan 2014 00:59:38 UTC +00:00], ["name", "Double Blackness"], ["slug", "double-blackness"], ["synopsis", "great manga"], ["updated_at", Sat, 11 Jan 2014 00:59:38 UTC +00:00]]
---
  def create
    @manga = Manga.new(params[:manga])

    respond_to do |format|
      if @manga.save

SELECT `chapters`.* FROM `chapters` WHERE `chapters`.`manga_id` IN (1)
SELECT `mangas`.* FROM `mangas` WHERE `mangas`.`slug` = 'double-blackness' LIMIT 1
---
  def show
    if params[:id_or_slug] =~ /^\d+$/
      @manga = Manga.includes(:chapters).find(params[:id_or_slug])