app/controllers/pagetexts_controller.rb

SELECT "pagetexts".* FROM "pagetexts" ORDER BY id
---
  def index
    @pagetexts = Pagetext.all

SELECT "pagetexts".* FROM "pagetexts" WHERE "pagetexts"."id" = $1 LIMIT 1  [["id", "2"]]
---
  def edit
    @pagetext = Pagetext.find(params[:id])

INSERT INTO "pagetexts" ("created_at", "text", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Mon, 13 Jan 2014 20:11:16 UTC +00:00], ["text", "home page page text"], ["updated_at", Mon, 13 Jan 2014 20:11:16 UTC +00:00]]
---
  def create
    @pagetext = Pagetext.new(params[:pagetext])

    respond_to do |format|
      if @pagetext.save

SELECT "pagetexts".* FROM "pagetexts" WHERE "pagetexts"."id" = $1 LIMIT 1  [["id", "2"]]
UPDATE "pagetexts" SET "text" = '<div class="youtube">
---
  def update
    @pagetext = Pagetext.find(params[:id])

    respond_to do |format|
      if @pagetext.update_attributes(params[:pagetext])