app/controllers/sitepages_controller.rb

    def home
      @slides = Slide.order("id")
      @updates = Update.order("created_at DESC").limit(3)
---
SELECT "slides".* FROM "slides" ORDER BY id
SELECT "updates".* FROM "updates" ORDER BY created_at DESC LIMIT 3

    def media
      @videos = Video.order("created_at DESC")
---
SELECT "videos".* FROM "videos" ORDER BY created_at DESC

    def store
       @commissions = Item.find_all_by_category("Commission")
---
SELECT "items".* FROM "items" WHERE "items"."category" = 'Commission'