app/controllers/slides_controller.rb

SELECT "slides".* FROM "slides" ORDER BY id
---
  def index
    @slides = Slide.order("id")

SELECT "slides".* FROM "slides" WHERE "slides"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def edit
    @slide = Slide.find(params[:id])

SELECT "slides".* FROM "slides" WHERE "slides"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "slides" SET "url" = '//www.youtube.com/embed/z5_wrCgs4tI', "updated_at" = '2014-01-13 19:21:31.458104' WHERE "slides"."id" = 1
---
  def update
    @slide = Slide.find(params[:id])

    respond_to do |format|
      if @slide.update_attributes(params[:slide])