app/controllers/updates_controller.rb

  def index
    @updates = Update.all
---
SELECT "updates".* FROM "updates"

  def show
    @update = Update.find(params[:id])
---
SELECT "updates".* FROM "updates" WHERE "updates"."id" = $1 LIMIT 1  [["id", "1"]]

  def create
    @update = Update.new(params[:update])

    respond_to do |format|
      if @update.save
---
INSERT INTO "updates" ("body", "created_at", "title", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"